#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.vercel_project_directory.portfolio: Reading...
data.vercel_project_directory.portfolio: Read complete after 0s [id=../frontend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vercel_deployment.portfolio will be created
  + resource "vercel_deployment" "portfolio" {
      + domains          = (known after apply)
      + files            = {
          + "../frontend/Dockerfile"                                                   = "176~295713338e683ca9e6ba0d9c878e52a36bd3fc24"
          + "../frontend/docker-compose.yml"                                           = "216~a29d345dee4101331c6a5f9ec3b5c60e6f64bc04"
          + "../frontend/firebase.json"                                                = "107~288092835f2c51fefe9ba0f51f702a71ea748dda"
          + "../frontend/next-env.d.ts"                                                = "201~06e5b053de5e90cae065a2ac8a57758316aeb8ea"
          + "../frontend/next-sitemap.js"                                              = "128~c6cdbaa6e0a989c632c0855258fb177669cb95ae"
          + "../frontend/next.config.js"                                               = "150~ee63194b0da93e19e5d79b3546a50b11bc2f6ff4"
          + "../frontend/package.json"                                                 = "909~15a1f9d09cb300d712fe1b060d7d5cdba63f99db"
          + "../frontend/public/images/GitHub-Mark-120px-plus.png"                     = "4268~8e4af8e0da1da6fb685e86c19afb5322d559a8ca"
          + "../frontend/public/images/TaskManagement.png"                             = "74222~96c671bd5e24dcb9512c75a473ce3b6d4a5c98ba"
          + "../frontend/public/images/TheaTalk.png"                                   = "1087589~e790f66631795596d106e71ba295d973a979680e"
          + "../frontend/public/images/ange_icon_large.png"                            = "12372~b806b552461e825b83f608c7bd94423f6506baf8"
          + "../frontend/public/images/ange_icon_small.png"                            = "2696~8ee3c0e090cb688c9a38f4b78a6f1a52bfb1a56f"
          + "../frontend/public/images/expand.svg"                                     = "229~e1884568532289c4bd5f10c30dc35c52b2a1ca66"
          + "../frontend/public/images/fansite.png"                                    = "589707~b8b2a0a83b1d320e205d6516581881268407987a"
          + "../frontend/public/images/favicon.ico"                                    = "41662~3a39170497122bb7b5c7e62ec8d4f6d4c32fe62d"
          + "../frontend/public/images/ogp.png"                                        = "283214~974a8f8a10b0ed277c507e4fc0924f8a57b47134"
          + "../frontend/public/images/portfolio.png"                                  = "64943~2277f55090b8553e74a7c5c6ba3dcbf3d0be502a"
          + "../frontend/public/images/profile.jpeg"                                   = "17022~a8103fd66ea14cdeb1b4440c1f8448e7a86e3d3c"
          + "../frontend/public/images/sampleAnimation.gif"                            = "428603~aee9fc136dbdb2c2bdf4475352786ce2d0a682f3"
          + "../frontend/public/images/twitter.png"                                    = "4861~fd62daf32f38818701b9bca04021ce3177199aca"
          + "../frontend/src/animations/CreateDriftingAnimation.ts"                    = "1238~455d37b67b40736a26389c54381d1ddcb5202002"
          + "../frontend/src/animations/CreateJumpAnimation.ts"                        = "1450~8ce9f1785f6cd33e2a73efff695e333fefdb6d23"
          + "../frontend/src/animations/CreateLoadingAnimation.ts"                     = "2039~e05f9bf6b35def53e33e276e52083b0ad791cebf"
          + "../frontend/src/animations/CreateMovingWindowFromRightAnimation.ts"       = "855~01f8208b80bfc497c0b93fe81370ea7ef73d0afc"
          + "../frontend/src/animations/CreateShakeAndUpAnimation.ts"                  = "3962~9a24cce6d0ee7a314fbe9a7ba91ea2e5a94fe265"
          + "../frontend/src/animations/index.ts"                                      = "504~f4b38e7fc56cc22bbdfb59dc65012aba356ca905"
          + "../frontend/src/components/animations/index.ts"                           = "144~f706f5f2735e03c423bd65ce2f5b90bdd81320df"
          + "../frontend/src/components/animations/loadingAnimation/index.module.css"  = "1843~30d87e9800ffaefc4285c7053fbb0e124299ffff"
          + "../frontend/src/components/animations/loadingAnimation/index.module.sass" = "725~7f085450527d2064fc8b99314bf3c76f9c488b0c"
          + "../frontend/src/components/animations/loadingAnimation/index.tsx"         = "2382~3a4a69d646dfec4ab9a4040b2a71354bd02d7ec7"
          + "../frontend/src/components/animations/textAnimation/index.module.css"     = "44~d8da4ecd8fa83bb5f2e79ba0a95997dd7619ae87"
          + "../frontend/src/components/animations/textAnimation/index.module.sass"    = "0~da39a3ee5e6b4b0d3255bfef95601890afd80709"
          + "../frontend/src/components/animations/textAnimation/index.tsx"            = "1077~a720dd73f58b7fdbadad351ff2c6082d6d321b71"
          + "../frontend/src/components/card/index.module.css"                         = "1850~bcf5fc7e719ea9c03b503f89f25dde0b3ba55902"
          + "../frontend/src/components/card/index.module.sass"                        = "678~d44613989b277f324863d46cb9d43ac99ec81ed8"
          + "../frontend/src/components/card/index.tsx"                                = "1738~a5098c3669b5022790548c6b68f506c72900dc3e"
          + "../frontend/src/components/copyright/index.module.css"                    = "1149~485ca4dd6273c1cb55a302d0c69594b82f551e41"
          + "../frontend/src/components/copyright/index.module.sass"                   = "75~e4c4aa4e730a21ac61189b9f789bb3c6e8dd4eb3"
          + "../frontend/src/components/copyright/index.tsx"                           = "229~35827cb211bf37f4678548d084741cb4b85687b5"
          + "../frontend/src/components/index.ts"                                      = "243~7e83aba305936ffbbf3979ea0a74001d05e8ebf3"
          + "../frontend/src/components/timepoint/index.module.css"                    = "2606~d2f7bb8af740989dbc7ae0ae26cbef196d022bf9"
          + "../frontend/src/components/timepoint/index.module.sass"                   = "1452~56f5c3926d19afc6dd08ec1b93ee9b207c24afd0"
          + "../frontend/src/components/timepoint/index.tsx"                           = "1072~15de05f3c529dc0fa90ef69d1199732b01b5bacf"
          + "../frontend/src/datas/history.ts"                                         = "2410~3f4aa0d979243e08398bee4ab082a63afb4c1a8e"
          + "../frontend/src/datas/index.ts"                                           = "171~262f5e1156be5633be5554145c489d8fc02745c6"
          + "../frontend/src/datas/skill.ts"                                           = "2906~19d2317add0ab8689c6c604f7f83540775369e53"
          + "../frontend/src/datas/timeline.ts"                                        = "6931~bb292dcb6d93db565b4c6a52229eb0269fbaab64"
          + "../frontend/src/pages/_app.css"                                           = "158~db648c8d3e7caee7bc1c9e2e0541f356babba922"
          + "../frontend/src/pages/_app.sass"                                          = "177~1f9496228b34d0a38501a71652b2a731f2c607b4"
          + "../frontend/src/pages/_app.tsx"                                           = "323~4c6dc3f4b8aed4fd8c2e5b96b1ec684d6d4f9a72"
          + "../frontend/src/pages/_document.tsx"                                      = "2645~6b9326ddcc98ac908a37da7920fc385884526994"
          + "../frontend/src/pages/index.tsx"                                          = "576~aa3a445f34603250f4a69fe7b985fe2b8500187e"
          + "../frontend/src/template.css"                                             = "1098~c8fc6dd41f71785f15c48ebea2b029616bf25b96"
          + "../frontend/src/template.sass"                                            = "1459~4fe151f7d4988cb37b47a6bc141507ab19e2d268"
          + "../frontend/src/templates/history/index.module.css"                       = "1765~e62b707b09012080c9e30539a1c48aafb8e731d3"
          + "../frontend/src/templates/history/index.module.sass"                      = "651~52a6659ad2271e642c0c1b08f8edc528bada1494"
          + "../frontend/src/templates/history/index.tsx"                              = "636~7df681d4eeca79bdd64a90f38303a706d9fe7f4a"
          + "../frontend/src/templates/index.ts"                                       = "305~b3ac29602699aaf78198d988f3d34e13156d4bb8"
          + "../frontend/src/templates/intro/index.module.css"                         = "4213~a4cb2a5c058761dc47e2870aa24a0aab0e6fb4d8"
          + "../frontend/src/templates/intro/index.module.sass"                        = "2519~f0b79b06f5df40bb0918b86f1eb69e1346aa6ba0"
          + "../frontend/src/templates/intro/index.tsx"                                = "3268~c9c9029aa1a4c01b7820ea1c00dadce83869873a"
          + "../frontend/src/templates/profile/index.module.css"                       = "2405~e40eb2f1826d77f70c413e725847c0c7a7853476"
          + "../frontend/src/templates/profile/index.module.sass"                      = "1238~73cb72baddcb479c27e12e4322c625759ba0a271"
          + "../frontend/src/templates/profile/index.tsx"                              = "2109~45e06950eec8b129dd98458264a2dacdfe5f538a"
          + "../frontend/src/templates/skill/index.module.css"                         = "1614~5a69c4e9850e90ae8c25208ad201786fa62e3793"
          + "../frontend/src/templates/skill/index.module.sass"                        = "504~579cb72f6014f5219bdf25184cfa4dc0d433837e"
          + "../frontend/src/templates/skill/index.tsx"                                = "539~8307b0979ab0359182a7262f5e8ac106bf981708"
          + "../frontend/src/templates/timeline/index.module.css"                      = "1155~a4571bca7fa79b35c8eb03adbd03965681dd2ea9"
          + "../frontend/src/templates/timeline/index.module.sass"                     = "81~5f661aa0b608276f7458b07ffe5d95825ca34ce0"
          + "../frontend/src/templates/timeline/index.tsx"                             = "433~97e37b1605487be4b7f8febe3b25ad716aa68ef0"
          + "../frontend/src/templates/type.ts"                                        = "577~f3498262ecc7cf6f0f9bc1763166d0d67452b526"
          + "../frontend/tsconfig.json"                                                = "7911~c7c67372a698177f9b0c3815bdf80130aff217ad"
          + "../frontend/webpack.config.ts"                                            = "1279~2ee0d82126b717a8f6f42c57fcb241e1a6107cce"
          + "../frontend/yarn.lock"                                                    = "75383~7785e68b2b304c98eda9b979a26b4d50e14fcfd1"
        }
      + id               = (known after apply)
      + path_prefix      = "../frontend"
      + production       = true
      + project_id       = (known after apply)
      + project_settings = {
          + root_directory = "../frontend"
        }
      + team_id          = (known after apply)
      + url              = (known after apply)
    }

  # vercel_project.portfolio will be created
  + resource "vercel_project" "portfolio" {
      + framework                  = "nextjs"
      + git_repository             = {
          + production_branch = (known after apply)
          + repo              = "ruritoBlogger/ruritoBlogger.github.io"
          + type              = "github"
        }
      + id                         = (known after apply)
      + name                       = "portfolio"
      + serverless_function_region = (known after apply)
      + team_id                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `called terraform plan workflow`*